LC3WithoutExtensionFilled/0/blueprints/flowrate/U.1
    {
        // Computes the velocity that is needed for a certain flowrate
        type            flowRateWaterVelocity;
