LC3WithoutExtensionFilled/0/blueprints/flowrate/omega
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
