LC3WithoutExtensionFilled/0/blueprints/wall_friction/U.1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
