LC3WithoutExtensionFilled/0/blueprints/wall_slip/k
    {
        type            zeroGradient;
    }
