LC3WithoutExtensionFilled/0/blueprints/waterlevel/k
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    
